{
    "permalink": "shmove-reservations",
    "title": "Shmove Reservations",
    "subTitle": "Reservations made easy",
    "date": "2021-1-22",
    "summary": "A reservation system for In-Ki Shiatsu to lower the barrier for making an appointment.",
    "weblink": "",
    "coverImage": "projects/shmove-reservations/beauty-calendar-overview",
    "squareImage": "projects/shmove-reservations/beauty-appointment-modal",
    "projectContextImage": "projects/shmove-reservations/calendar-overview",
    "projectContext": "The first team project at Open-ICT was to build a reservation system for barbers. When my stepmother heard about the project she asked if we wanted to build a reservation system for her Shiatsu Studio. We jumped on the chance to build a project for a real client. The main goal for the reservation system was to reduce the barrier to book an appointment, the design followed from this principle.",
    "inDepth": [{
        "title": "Responsibilities",
        "paragraph": "For this project I took up the role of front end developer. Before this project I had just built my portfolio website in Flask. There I had focused on the back end, that’s why I was curious to learn about front end development. I had no previous experience working with JavaScript, let alone working with a front end framework. We chose to work with Vue, because the learning curve is supposedly less steep. We combined this with the Vuetify library, which includes a great looking calendar that we could use as a base. At the end of the project I deployed the website to Python Anywhere, and made sure that everything worked correctly. This involved a bit of work on the back end, built in Django, to get everything running smoothly.",
        "wideImage": "projects/shmove-reservations/choose-appointment",
        "squareImage": "projects/shmove-reservations/confirmation"
        },
        {
        "title": "Design Decisions",
        "paragraph": "The main goal for this project was to lower the barrier for making an appointment. During the research phase we had seen that similar systems often have the user answer a bunch of questions before showing available time slots. We wanted to avoid that and show times immediately. This would allow users to see if their time slot was available directly, and it lets them see how their choices influence availability. It also means that a user does not have to fill out a complete survey, only to discover there were no spots available at a time that works for them.",
        "wideImage": "projects/shmove-reservations/appointment-modal"
        }
    ]
}